function [ r1, r2 ] = intersectsphere( p1, p2, c, r )
%INTERSECTSPHERE координаты пересечение луча со сферной
%   Функция возвращает координаты точек пересечения сферы
%   с лучом заданным точками p1, p2
%   p1     - точка начала луча
%   p2     - вторая точка луча
%   c      - центр сферы
%   r      - радиус сферы
%   r1, r2 - точки пересечения

%   Zheltov Victor

r1 = [];
r2 = [];

l = p2(1) - p1(1);
m = p2(2) - p1(2);
n = p2(3) - p1(3);

A = l*l + m*m + n*n;
B = 2*( (p1(1) - c(1))*l + (p1(2) - c(2))*m + (p1(3) - c(3))*n );
C = (p1(1) - c(1))^2 + (p1(2) - c(2))^2 + (p1(3) - c(3))^2 - r^2;

D = (B.^2 - 4.*A.*C);

if ( D >= 0 )
    D = realsqrt(D);
    
    t1 = (-B - D)/(2*A);
    t2 = (-B + D)/(2*A);

    r1 = p1 + (p2 - p1) * t1;
    r2 = p1 + (p2 - p1) * t2;
end